[
  {
    "id": 1,
    "title": "Tech-Talk",
    "description": " Tech-Talk is an app where user can add all tech meetups, mark them as favorite and create new meetup. Tech-Talk uses react, google firebase and tailwind css.",
    "details": "I wanted to create an app where I can add all my tech meetups, mark them as favorite and create new meetups all in one place. I did an initial research on meetup apps, and designed wireframes to get a better understanding of the app. After prototyping, I started building the app using React and used google firebase to store the data. I used tailwind css to style the app.",
    "tools": " html, css, react, tailwind css, firebase,",
    "image": "/images/tech-talk.png",
    "github": "https://github.com/MuhammadUsmanMushtaq/tech-talk",
    "live": "https://tech2talk.netlify.app/"
  },
  {
    "id": 2,
    "title": "fake imdb",
    "description": " IMDB movie search fullstack app and it uses OMDB API, react, node, and express.",
    "details": "I worked on the idea to create an app where I can search for movies and their imdb ratings faster. I wanted to get myself comfortable with creating servers and own api by working further on this full stack app. I used omdb an external API for the data and used React to create the front end and node and express to create the server.",
    "tools": " html, css, react, node, express,",
    "image": "/images/fake_imdb.png",
    "github": "https://github.com/MuhammadUsmanMushtaq/hackday-project",
    "live": ""
  },
  {
    "id": 3,
    "title": "starwars api",
    "description": " A star war characters information search app and it uses SWAPI API, react, styled components and netlify for deployment.",
    "details": "As a fan of starwars, I have always wanted to create an app where I can search for starwars characters and their information. I made use of SWAPI API, a great API for the data I needed and used React to create the front end and used styled components to style the app.",
    "tools": "HTML, CSS, Javascript, React, SWAPI API",
    "image": "/images/starwars_SWAPI.png",
    "github": "https://github.com/MuhammadUsmanMushtaq/starWars-SWAPI",
    "live": "https://starwars-swapi-usman.netlify.app/"
  },
  {
    "id": 4,
    "title": "wait cure",
    "description": " WaitCure by Zymego is a web application to improve patient waiting times. Patients can reschedule, get earlier times or cancel their appointments through a simple UI.",
    "details": "Waitcure is my internship project at Zymego. I worked on the design of the app from scratch. I started the project with user research, which included patients and nurses user groups. Figma was used to create clickable prototypes. After several rounds of iterations, I along with the back end developer created the app with React, we made use of material designs UI components and graphql to mock the data for the first version of the app.",
    "tools": "Miro, Figma, User research and testing, html, css, javascript, React",
    "image": "/images/waitcure.png",
    "github": "",
    "live": "https://www.figma.com/proto/ylTFLMybDSfNI8ccGbg0BX/Waitcure-Prototype?node-id=2%3A1&viewport=496%2C431%2C0.14515800774097443&scaling=scale-down&page-id=0%3A1"
  },
  {
    "id": 5,
    "title": "ux review for eu bikes",
    "description": "UX review on EU bike service and recommend improvements to satisfy both the user goals and the business goals.",
    "details": "The main aim of this school project was to analyze the user experience of the EU bike service and to recommend improvements to satisfy both the user goals and the business goals. This project was a UX research project, I used user research methods such as usability testing, empathy mapping, heuristic evaluations to bring out all the usability issues asscociated with the app and proposed design recommendations to improve the UX of the app.",
    "tools": "miro, figma, user research, user testing, user flows, wireframes, prototyping",
    "image": "/images/EuBike.png",
    "github": "",
    "live": "https://www.figma.com/proto/ylTFLMybDSfNI8ccGbg0BX/Waitcure-Prototype?node-id=2%3A1&viewport=496%2C431%2C0.14515800774097443&scaling=scale-down&page-id=0%3A1"
  },
  {
    "id": 6,
    "title": "portfolio v1",
    "description": " Personal portfolio page using react, styled components and netlify for deployment.",
    "details": "This is the first version of my portfolio project. I wanted to create a single page simple portfolio to showcase my work and skills. I used React to create the front end and used styled components to style the app.",
    "tools": "html,css, react, styled components",
    "image": "/images/portfolio_v1.png",
    "github": "https://github.com/MuhammadUsmanMushtaq/portfolio",
    "live": "https://muhammad-usman.netlify.app/"
  }
]
